문제1) 시리즈 연산 

시리즈와 숫자 연산하는 문제입니다

할인 적용하기

아래와 같은 상품 가격 데이터가 Series로 주어졌습니다.

요구사항

- 시리즈를 만들고

- 모든 상품 가격에 10% 할인된 금액을 계산해서 출력하세요.

(힌트: 가격 * 0.9)

In [16]:
import pandas as pd


item = {'상품명':['키보드', '마우스', '모니터'],'가격':[30000, 15000, 200000]}

item_Ser = pd.Series(item)

item_div =

SyntaxError: invalid syntax (4252729858.py, line 8)

In [ ]:
# 문제1) 산술연산 문제1)

import pandas as pd

price = pd.Series([30000, 15000, 200000], index=['키보드', '마우스', '모니터'])
print(price)
discount_price = price * 0.9
print(discount_price)

키보드     30000
마우스     15000
모니터    200000
dtype: int64
키보드     27000.0
마우스     13500.0
모니터    180000.0
dtype: float64

문제2) 시리즈 연산 
시리즈와 숫자 연산하는 문제입니다

요구사항
모든 메뉴 가격에 부가세 10%를 추가해서 최종 결제 금액을 계산하세요.
(힌트: 가격 * 1.1)

In [ ]:
import pandas as pd

item = pd.Series([5500, 15000, 12000], index=['햄버거', '피자', '파스타'])

item_up = item*1.1

item_up

햄버거     6050.0
피자     16500.0
파스타    13200.0
dtype: float64

문제3) 시리즈와 시리즈 연산 문제

​상품 총 금액 계산하기

다음과 같이 상품 가격과 구매 수량 데이터가 주어졌습니다.

요구사항

상품 가격과 수량 두 개의 Series를 곱해서

각 상품의 총 금액(가격 × 수량) 을 계산한 결과를 출력하세요.

In [ ]:
import pandas as pd

item_price = pd.Series([30000, 15000, 200000], index=['키보드', '마우스', '모니터'])

item_num = pd.Series([2, 3, 1], index=['키보드', '마우스', '모니터'])

item_sum = item_price * item_num

item_sum

키보드     60000
마우스     45000
모니터    200000
dtype: int64

문제4) 시험 점수 평균 계산하기

아래는 학생들의 중간고사 점수와 기말고사 점수가 Series로 주어져 있습니다.

요구사항

중간고사와 기말고사 점수를 이용해서 학생별 평균 점수를 계산해서 출력하세요.

(힌트: (중간고사 + 기말고사) / 2)

In [ ]:
import pandas as pd

mid_grade = pd.Series([80, 85, 78], index=['철수', '영희', '민수'])

last_grade = pd.Series({"철수":90, "영희":95, "민수":88})

avg_score = (mid_grade + last_grade)/2

print(avg_score)

df = pd.DataFrame([mid_grade, last_grade, avg_score], index=['중간', '기말', '평균'])

df.T

철수    85.0
영희    90.0
민수    83.0
dtype: float64

      중간    기말    평균
철수  80.0  90.0  85.0
영희  85.0  95.0  90.0
민수  78.0  88.0  83.0

문제5) pandas의 연산 메소드(add(), sub(), mul(), div())를 활용하는 문제

요구사항

연산 메소드 mul()과 sub()를 사용해서 아래 계산을 수행하세요.

최종가격 = 가격 - (가격 × 할인율/100)

​

조건:

mul()을 사용해 할인액을 계산.

sub()을 사용해 최종 가격을 계산.

최종 결과를 출력하세요.

In [ ]:
# 문제5
price = pd.Series([30000, 15000, 20000], index = ['키보드', '마우스', '모니터']) 
dis_rate = pd.Series([10, 5, 20], index = ['키보드', '마우스', '모니터'])
cal1 =  price.mul(dis_rate, fill_value=0)
cal2 = cal1.div(100.0, fill_value=0)
fin_price = price.sub(cal2, fill_value=0)
print(fin_price)
df = pd.DataFrame( [price, fin_price], index=['원가가격', '최종가격'] )
data=df.T
data

키보드    27000.0
마우스    14250.0
모니터    16000.0
dtype: float64

        원가가격     최종가격
키보드  30000.0  27000.0
마우스  15000.0  14250.0
모니터  20000.0  16000.0

In [ ]:
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset('titanic')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
titanic.loc[0:51, ['age', 'fare']]
titanic.head()
titanic.tail()
t_age_fare = titanic.loc[0:51, ['age', 'fare']]

addition = t_age_fare + 10

addition

     age      fare
0   32.0   17.2500
1   48.0   81.2833
2   36.0   17.9250
3   45.0   63.1000
4   45.0   18.0500
5    NaN   18.4583
6   64.0   61.8625
7   12.0   31.0750
8   37.0   21.1333
9   24.0   40.0708
10  14.0   26.7000
11  68.0   36.5500
12  30.0   18.0500
13  49.0   41.2750
14  24.0   17.8542
15  65.0   26.0000
16  12.0   39.1250
17   NaN   23.0000
18  41.0   28.0000
19   NaN   17.2250
20  45.0   36.0000
21  44.0   23.0000
22  25.0   18.0292
23  38.0   45.5000
24  18.0   31.0750
25  48.0   41.3875
26   NaN   17.2250
27  29.0  273.0000
28   NaN   17.8792
29   NaN   17.8958
30  50.0   37.7208
31   NaN  156.5208
32   NaN   17.7500
33  76.0   20.5000
34  38.0   92.1708
35  52.0   62.0000
36   NaN   17.2292
37  31.0   18.0500
38  28.0   28.0000
39  24.0   21.2417
40  50.0   19.4750
41  37.0   31.0000
42   NaN   17.8958
43  13.0   51.5792
44  29.0   17.8792
45   NaN   18.0500
46   NaN   25.5000
47   NaN   17.7500
48   NaN   31.6792
49  28.0   27.8000
50  17.0   49.6875
51  31.0   17.8000

In [ ]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame({'열A':[15, 20, 50, np.nan, np.nan],
                    '열B':[100, 500, 200, 500, 200], 
                    '열C':[1, 2, 3, 2, 3]},
                   index=['행0', '행1', '행2', '행3', '행4'])

df1

df2 = pd.DataFrame({'열A':[10, 10, 10, 20, 30],
                    '열B':[200, 100, 200, 100, 100]}, 
                   index=['행0', '행1', '행2', '행3', '행4'])

df3 = df1.add(df2, fill_value= 0)
print(df3)

      열A   열B   열C
행0  25.0  300  1.0
행1  30.0  600  2.0
행2  60.0  400  3.0
행3  20.0  600  2.0
행4  30.0  300  3.0

In [ ]:
df3.loc['행1', '열A'] != 30

False

In [ ]:
titanic.head()
df = titanic.loc[0:9, ['age', 'fare']]
print(df['age'],df['age'] < 20)
df[df['age'] < 20]
df[df.age < 20]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64 0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8    False
9     True
Name: age, dtype: bool

    age     fare
7   2.0  21.0750
9  14.0  30.0708

In [ ]:
df[~(df.age < 20)] #~()는 반대로 출력

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500
5   NaN   8.4583
6  54.0  51.8625
8  27.0  11.1333

In [ ]:
df[(df.age >= 20) & (df.age <= 29) ]

    age     fare
0  22.0   7.2500
2  26.0   7.9250
8  27.0  11.1333

In [ ]:
df_age_sex = titanic.loc[0:9, ['age', 'sex']]
df_age_sex

    age     sex
0  22.0    male
1  38.0  female
2  26.0  female
3  35.0  female
4  35.0    male
5   NaN    male
6  54.0    male
7   2.0    male
8  27.0  female
9  14.0  female

In [ ]:
df_age_sex[(df_age_sex.age < 20) & (df_age_sex.sex == 'female')]

    age     sex
9  14.0  female

In [ ]:
df_age_sex[(df_age_sex.age < 20) | (df_age_sex.sex == 'female')]

    age     sex
1  38.0  female
2  26.0  female
3  35.0  female
7   2.0    male
8  27.0  female
9  14.0  female

In [ ]:
mask = (titanic.age < 10) | (titanic.age < 60)
titanic.loc[mask, ['age', 'sex', 'alone']]

      age     sex  alone
0    22.0    male  False
1    38.0  female  False
2    26.0  female   True
3    35.0  female  False
4    35.0    male   True
..    ...     ...    ...
885  39.0  female  False
886  27.0    male   True
887  19.0  female   True
889  26.0    male   True
890  32.0    male   True

[688 rows x 3 columns]

문제6) 데이터프레임 연산 문제

데이터프레임과 숫자와 연산하는 문제입니다.

​
물가 상승률 반영하기

아래와 같은 상품 가격표 데이터프레임이 있습니다.

요구사항

2024년 가격에 앞으로 5% 인상된 가격을 적용해서

새로운 예상 가격 컬럼을 추가하세요.

공식: 예상 가격 = 2024년 가격 * 1.05

In [ ]:
import pandas as pd

my_item = pd.DataFrame({'상품명':['키보드','마우스','모니터'],
                    '2023년 가격(원)':[30000, 15000, 200000],
                    '2024년 가격(원)':[33000, 16500, 220000]},)

my_item

   상품명  2023년 가격(원)  2024년 가격(원)
0  키보드        30000        33000
1  마우스        15000        16500
2  모니터       200000       220000

In [ ]:
import pandas as pd

my_item = pd.DataFrame({'2023년 가격(원)':[30000, 15000, 200000],
                        '2024년 가격(원)':[33000, 16500, 220000]},
                        index=[ '키보드', '마우스', '모니터'])

my_item

     2023년 가격(원)  2024년 가격(원)
키보드        30000        33000
마우스        15000        16500
모니터       200000       220000

요구사항

2024년 가격에 앞으로 5% 인상된 가격을 적용해서

새로운 예상 가격 컬럼을 추가하세요.

공식: 예상 가격 = 2024년 가격 * 1.05

In [ ]:
예상가격 = my_item.loc[ :, '2024년 가격(원)'] * 1.05
print(예상가격)

my_item['예상가격'] = 예상가격
my_item

키보드     34650.0
마우스     17325.0
모니터    231000.0
Name: 2024년 가격(원), dtype: float64

     2023년 가격(원)  2024년 가격(원)      예상가격
키보드        30000        33000   34650.0
마우스        15000        16500   17325.0
모니터       200000       220000  231000.0

In [ ]:
# 문제6 데이터프레임 연산 문제
df =pd.DataFrame( {'상품명': ['키보드','마우스','모니터'], 
               '2023년 가격(원)':[30000,15000, 200000] , 
               '2024년 가격(원)':[33000, 16500, 220000] } )
df = df.set_index('상품명')
df['예상가격'] = df['2024년 가격(원)'] * 1.05
df

문제7) 데이터프레임과 데이터프레임 연산하는 문제입니다

​

매출 데이터 비교

아래 두 개의 DataFrame이 있습니다.

한 해 동안 1분기와 2분기 매출을 나타낸 데이터입니다.

​

In [ ]:
# 문제7 데이터프레임과 데이터프레임 연산하는 문제
df_1 = pd.DataFrame( {'상품명': ['키보드','마우스','모니터'], 
               '매출액':[60000,45000, 1200000] } )
df_2 = pd.DataFrame( {'상품명': ['키보드','마우스','모니터'], 
               '매출액':[72000,51000, 1500000] } )
print(df_1)
print(df_2)

   상품명      매출액
0  키보드    60000
1  마우스    45000
2  모니터  1200000
   상품명      매출액
0  키보드    72000
1  마우스    51000
2  모니터  1500000

요구사항

두 데이터프레임을 상품명을 인덱스로 맞춘 후,

2분기 매출액에서 1분기 매출액을 빼서

분기별 매출 증가액을 계산하세요!

In [ ]:
df_1=df_1.set_index('상품명')
df_2=df_2.set_index('상품명')
df_increase = df_2 - df_1
df_increase

문제8) 필터링에서 불린 인덱싱 문제입니다

블린 인덱싱은 조건에 맞는 데이터를 빠르게 추출할 때 매우 유용합니다

매출이 100만 원 이상인 상품 찾기

다음과 같은 상품 매출 데이터프레임이 주어졌습니다.

In [ ]:
# 문제8 필터링에서 불린 인덱싱 문제
df =pd.DataFrame( {'상품명': ['키보드','마우스','모니터', '헤드셋','웹캠'], 
               '매출액(원)':[300000,500000, 1500000, 80000, 120000] } )
df[ '매출액']


요구사항

매출액이 100만 원 이상인 상품만 필터링해서 출력하세요.

In [ ]:
df.매출액 >= 1000000
mask = df[ '매출액']  >= 1000000
mask
# df[ mask ]['매출액']
df[mask]

문제9) 필터링에서 불린 인덱싱 문제입니다

블린 인덱싱은 조건에 맞는 데이터를 빠르게 추출할 때 매우 유용합니다

나이 기준으로 필터링하기

다음은 여러 사람의 나이 데이터입니다.

In [ ]:
# 문제9
df = pd.DataFrame({'이름':['김철수', '이영희', '박민수', '정수현', '송지혜'], '나이':[25, 32, 40, 28, 35]})

요구사항

나이가 30세 이상인 사람들만 필터링해서 출력하세요.

In [ ]:
df = df.set_index('이름')
mask = df.나이 >= 30
df.loc[mask, '나이']
df[mask]['나이']

In [ ]:
titanic.head()
titanic.query('pclass == 1') # 해당하는 조건에 만족하는 것만 보여줌
titanic.query('who == "woman"') # 문자는 ""로 감싸줘야함
titanic.query('who == "woman" & deck == "C"') # 조건 두개를 묶을 경우
titanic.query('who == "woman" and deck == "C"') # 영어 and라고 써도 됌

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
88,1,1,female,23.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
151,1,1,female,22.0,1,0,66.6000,S,First,woman,False,C,Southampton,yes,False
177,0,1,female,50.0,0,0,28.7125,C,First,woman,False,C,Cherbourg,no,True
230,1,1,female,35.0,1,0,83.4750,S,First,woman,False,C,Southampton,yes,False
268,1,1,female,58.0,0,1,153.4625,S,First,woman,False,C,Southampton,yes,False
269,1,1,female,35.0,0,0,135.6333,S,First,woman,False,C,Southampton,yes,True
307,1,1,female,17.0,1,0,108.9000,C,First,woman,False,C,Cherbourg,yes,False
310,1,1,female,24.0,0,0,83.1583,C,First,woman,False,C,Cherbourg,yes,True
318,1,1,female,31.0,0,2,164.8667,S,First,woman,False,C,Southampton,yes,False
325,1,1,female,36.0,0,0,135.6333,C,First,woman,False,C,Cherbourg,yes,True
341,1,1,female,24.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
412,1,1,female,33.0,1,0,90.0000,Q,First,woman,False,C,Queenstown,yes,False
486,1,1,female,35.0,1,0,90.0000,S,First,woman,False,C,Southampton,yes,False
498,0,1,female,25.0,1,2,151.5500,S,First,woman,False,C,Southampton,no,False
571,1,1,female,53.0,2,0,51.4792,S,First,woman,False,C,Southampton,yes,False
581,1,1,female,39.0,1,1,110.8833,C,First,woman,False,C,Cherbourg,yes,False
609,1,1,female,40.0,0,0,153.4625,S,First,woman,False,C,Southampton,yes,True
669,1,1,female,NaN,1,0,52.0000,S,First,woman,False,C,Southampton,yes,False
700,1,1,female,18.0,1,0,227.5250,C,First,woman,False,C,Cherbourg,yes,False
710,1,1,female,24.0,0,0,49.5042,C,First,woman,False,C,Cherbourg,yes,True
716,1,1,female,38.0,0,0,227.5250,C,First,woman,False,C,Cherbourg,yes,True
849,1,1,female,NaN,1,0,89.1042,C,First,woman,False,C,Cherbourg,yes,False
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False

In [ ]:
pd.set_option('display.max_columns', 10) # 화면에 출력되는 갯수를 변경

mask1 = titanic['embark_town'] == "Southampton"
mask2 = titanic['embark_town'] == "Queenstown"

df_boolean = titanic [mask1 | mask2]
print(df_boolean)
pd.get_option('display.max_columns') # 화면에 출력되는 갯수가 몇개인지 표시
pd.reset_option('display.max_columns') # 세팅된 것을 초기화

print(df_boolean)

     survived  pclass     sex   age  sibsp  ...  adult_male  deck  \
0           0       3    male  22.0      1  ...        True   NaN
2           1       3  female  26.0      0  ...       False   NaN
3           1       1  female  35.0      1  ...       False     C
4           0       3    male  35.0      0  ...        True   NaN
5           0       3    male   NaN      0  ...        True   NaN
..        ...     ...     ...   ...    ...  ...         ...   ...
885         0       3  female  39.0      0  ...       False   NaN
886         0       2    male  27.0      0  ...        True   NaN
887         1       1  female  19.0      0  ...       False     B
888         0       3  female   NaN      1  ...       False   NaN
890         0       3    male  32.0      0  ...        True   NaN

     embark_town alive  alone
0    Southampton    no  False
2    Southampton   yes   True
3    Southampton   yes  False
4    Southampton    no   True
5     Queenstown    no   True
..           ...   ...    ...
885   Queenstown    no  False
886  Southampton    no   True
887  Southampton   yes   True
888  Southampton    no  False
890   Queenstown    no   True

[721 rows x 15 columns]
     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
5           0       3    male   NaN      0      0   8.4583        Q   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
885         0       3  female  39.0      0      5  29.1250        Q   Third
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
5      man        True  NaN   Queenstown    no   True
..     ...         ...  ...          ...   ...    ...
885  woman       False  NaN   Queenstown    no  False
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
890    man        True  NaN   Queenstown    no   True

[721 rows x 15 columns]

In [ ]:
isin_filters = titanic['embark_town'].isin(['Southampton','Queenstown']) # isin 조건에 만족하는 것('Southampton or Queenstown)을 True , False로 나눔

titanic[isin_filters]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

문제9) 필터링에서 불린 인덱싱 문제입니다

블린 인덱싱은 조건에 맞는 데이터를 빠르게 추출할 때 매우 유용합니다

나이 기준으로 필터링하기

다음은 여러 사람의 나이 데이터입니다.

In [ ]:
person = pd.DataFrame({'이름':['김철수', '이영희', '박민수', '정수현', '송지혜'],
                       '나이':[25, 32, 40, 28, 35]})

person

    이름  나이
0  김철수  25
1  이영희  32
2  박민수  40
3  정수현  28
4  송지혜  35

요구사항

나이가 30세 이상인 사람들만 필터링해서 출력하세요.

In [ ]:
over_30 = person.나이 >= 30

person[over_30]

    이름  나이
1  이영희  32
2  박민수  40
4  송지혜  35

문제10) query() 메소드를 이용한 필터링 문제입니다

​가격 범위로 상품 필터링하기

다음은 상품 가격과 관련된 데이터프레임입니다.

In [ ]:
item = pd.DataFrame({'상품명':['키보드','마우스','모니터','헤드셋','웹캠'],
                     '가격(원)':[30000, 15000, 200000, 80000, 120000]})

item

   상품명   가격(원)
0  키보드   30000
1  마우스   15000
2  모니터  200000
3  헤드셋   80000
4   웹캠  120000

요구사항

가격이 30,000원 이상 100,000원 이하인 상품만 필터링하여 출력하세요.

In [ ]:
mask = (item['가격(원)'] >= 30000) & (item['가격(원)'] <= 100000)

item[mask]

   상품명  가격(원)
0  키보드  30000
3  헤드셋  80000

In [ ]:
# 문제10
df = pd.DataFrame( {'상품명': ['키보드','마우스','모니터', '헤드셋','웹캠'], 
                   '가격(원)':[300000, 500000, 1500000, 80000, 120000] } )
df=df.rename( columns = {'가격(원)': '가격'} )
# df = df.rename(columns={'A': 'Alpha', 'B': 'Beta'})
df.query( '가격 >= 30000 and 가격 <= 100000' )

문제11) isin() 메소드를 이용한 문제입니다

isin()은 특정 값들이 존재하는지 확인하고 필터링할 때 정말 유용한 메소드입니다

​특정 상품들만 필터링하기

다음은 다양한 상품들의 데이터입니다.

In [ ]:
item = pd.DataFrame({'상품명':['키보드', '마우스', '모니터', '헤드셋', '웹캠', '이어폰'],
                     '가격(원)':[30000, 15000, 200000, 80000, 120000, 25000]})
item

   상품명   가격(원)
0  키보드   30000
1  마우스   15000
2  모니터  200000
3  헤드셋   80000
4   웹캠  120000
5  이어폰   25000

문제:

'키보드', '마우스', '웹캠' 상품만 필터링하여 출력하세요.

isin() 메소드를 활용해 필터링할 수 있습니다.

In [ ]:
mask = item['상품명'].isin(['키보드', '마우스', '웹캠'])
item[mask]

   상품명   가격(원)
0  키보드   30000
1  마우스   15000
4   웹캠  120000

In [ ]:
import pandas as pd
import numpy as np

# object dtype
df1 = pd.DataFrame({'이름': ['철수', '영희', None]}, dtype='object') # 자동으로 None = np.nan 작동
# dtype='object'는 기본이기 때문에 생략할 수 있다
print(df1['이름'].dtype)  # object
print(df1)
# StringDtype
df2 = pd.DataFrame({'이름': ['철수', '영희', None]}, dtype='string') #자동으로 None = pd.NA로 작동
print(df2['이름'].dtype)  # string[python]
print(df2)

object
     이름
0    철수
1    영희
2  None
string
     이름
0    철수
1    영희
2  <NA>

In [ ]:
print(df1['이름'].isna())  # object: np.nan

0    False
1    False
2     True
Name: 이름, dtype: bool

In [ ]:
print(df2['이름'].isna())  # string: pd.NA 사용

0    False
1    False
2     True
Name: 이름, dtype: bool

In [ ]:
fruit_names = pd.Series(["Apple", "Banana", "Cherry"])
fruit_names

0     Apple
1    Banana
2    Cherry
dtype: object

In [ ]:
fruit_names = pd.Series(["Apple", "Banana", "Cherry"], dtype="string")
fruit_names

0     Apple
1    Banana
2    Cherry
dtype: string

In [ ]:
fruit_names = pd.Series(["Apple", "Banana", "Cherry"], dtype=pd.StringDtype())
fruit_names

0     Apple
1    Banana
2    Cherry
dtype: string

In [ ]:
fruit_names = fruit_names.astype('string') #dtype를 string으로 바꿀 때 쓰는 명령어
fruit_names

0     Apple
1    Banana
2    Cherry
dtype: string

In [ ]:
fruit_names = fruit_names.astype('object')
fruit_names

0     Apple
1    Banana
2    Cherry
dtype: object

In [ ]:
import pandas as pd
import numpy as np

ser_obj = pd.Series({'First':'Apple_사과',
                 'Second':'Banana_바나나',
                 'Third':'Cherry_체리',
                 'Fourth':np.nan})

ser_obj

First       Apple_사과
Second    Banana_바나나
Third      Cherry_체리
Fourth           NaN
dtype: object

In [ ]:
ser_str = pd.Series(["Apple_사과", "Banana_바나나", "Cherry_체리", np.nan],
               index=["First ", " Second", " Third", "Fourth"], dtype='string')
ser_str

First        Apple_사과
 Second    Banana_바나나
 Third      Cherry_체리
Fourth           <NA>
dtype: string

In [ ]:
ser_obj.str.lower()

First       apple_사과
Second    banana_바나나
Third      cherry_체리
Fourth           NaN
dtype: object

In [ ]:
ser_str.str.lower()

First        apple_사과
 Second    banana_바나나
 Third      cherry_체리
Fourth           <NA>
dtype: string

In [ ]:
ser_obj.str.upper()

First       APPLE_사과
Second    BANANA_바나나
Third      CHERRY_체리
Fourth           NaN
dtype: object

In [ ]:
ser_str.str.upper()

First        APPLE_사과
 Second    BANANA_바나나
 Third      CHERRY_체리
Fourth           <NA>
dtype: string

In [ ]:
ser_obj.str.split('_') # 해당 문자('_')로 리스트 형태로 나누기

First       [Apple, 사과]
Second    [Banana, 바나나]
Third      [Cherry, 체리]
Fourth              NaN
dtype: object

In [ ]:
s1 = pd.Series({'c0': 'A:10-20-30',
                'c1': 'B:20-50-40'})

s1 = s1.str.split('[:\-]') # 분류 해야 하는 기호가 2개(:, -)일때
s1

c0    [A, 10, 20, 30]
c1    [B, 20, 50, 40]
dtype: object

In [ ]:
s1 = pd.Series({'c0': 'A:10-20-30=50',
                'c1': 'B:20-50-40=60'})
s1 = s1.str.split('[:\-\=]') #분류 해야 하는 기호가 3개(:, -, =)일때
s1

c0    [A, 10, 20, 30, 50]
c1    [B, 20, 50, 40, 60]
dtype: object

In [ ]:
import pandas as pd
import numpy as np

ser_str = pd.Series({'First':'  Apple_사과  _500   ',
                 'Second':'   Banana_바나나      _300   ',
                 'Third':'   Cherry_체리   _1000   ',
                 'Fourth':np.nan})

ser_str

First              Apple_사과  _500
Second       Banana_바나나      _300
Third           Cherry_체리   _1000
Fourth                           NaN
dtype: object

In [ ]:
s1 = ser_str.str.split('_', expand=True) # expand = True는 DataFrame으로
s2 = ser_str.str.split('_', expand=False) # expand = False는 Series으로
s3 = ser_str.str.split('_') # expand = 디폴트는 Series

In [ ]:
s3.index

Index(['First', 'Second', 'Third', 'Fourth'], dtype='object')

In [ ]:
s3.values

array([list(['Apple', '사과  ', '500   ']),
       list(['Banana', '바나나      ', '300   ']),
       list(['Cherry', '체리   ', '1000   ']), nan], dtype=object)

In [ ]:
s3

First            [  Apple, 사과  , 500   ]
Second    [   Banana, 바나나      , 300   ]
Third        [   Cherry, 체리   , 1000   ]
Fourth                               NaN
dtype: object

In [ ]:
s3.str.strip()

First    NaN
Second   NaN
Third    NaN
Fourth   NaN
dtype: float64

In [ ]:
ser_str.str.strip() # 양쪽 공백 지우기

First           Apple_사과  _500
Second    Banana_바나나      _300
Third        Cherry_체리   _1000
Fourth                     NaN
dtype: object

In [ ]:
s_r = ser_str.str.replace("_", ":", regex=False) # 문자열 변경 (_ -> : 로 변경)
s_r

First              Apple:사과  :500
Second       Banana:바나나      :300
Third           Cherry:체리   :1000
Fourth                           NaN
dtype: object

In [ ]:
s_r_r = ser_str.str.replace("[^a-zA-Z\s]", "", regex=True ) # a-zA-Z까지의 영문 빼고 삭제, ^는 시작을 나타냄, \s는 공백 유지
s_r_r

First             Apple
Second       Banana
Third           Cherry
Fourth                   NaN
dtype: object

In [ ]:
s_r_r = ser_str.str.replace("[^가-힣\s]", "", regex=True ) # 가-힣 까지의 한글 빼고 삭제, ^는 시작을 나타냄, \s는 공백 유지
s_r_r

First             사과
Second       바나나
Third            체리
Fourth                NaN
dtype: object

In [ ]:
s_r_s = ser_str.str.replace("[^0-9]", "", regex=True ) # 숫자만 유지하고 나머지 삭제, ^는 시작을 나타냄 \s를 빼면 공백 없어짐
s_r_s

First      500
Second     300
Third     1000
Fourth     NaN
dtype: object

In [ ]:
get_1 = ser_str.str.split("_").str.get(1) # 스플릿으로 나눈 후 첫번째 것 출력하기
get_1

First          사과
Second    바나나
Third         체리
Fourth          NaN
dtype: object

In [ ]:
ser_str.str[5] # 각 줄 문자의 5번째 문자를 출력

First       l
Second      n
Third       e
Fourth    NaN
dtype: object

In [ ]:
ser_str.str.contains("A") # 문자에 A 가 있는지 물어봄

First      True
Second    False
Third     False
Fourth      NaN
dtype: object

In [ ]:
ser_str.str.contains("A", na=False) # nan 값은 False로 처리

First      True
Second    False
Third     False
Fourth    False
dtype: bool

In [ ]:
ser_str.str.contains(r"[A|B][a-z]+") #r은 정규표현식을 표현하는 것임, 패턴 포함 여부 확인
# 첫글자가 [A 또는 B],[두번째 글자는 소문자], +는 처음 조건을 포함한 나머지 글자들도 계속 비교해서 맞는지 확인함.

First      True
Second     True
Third     False
Fourth      NaN
dtype: object

In [ ]:
import re
pattern = r"[A|C][a-z]"
test_string = [ "Apple", "Cat","hello", "Bat", "A" ]
for s in test_string:
    match = re.match( pattern, s )
    print(match)

<re.Match object; span=(0, 2), match='Ap'>
<re.Match object; span=(0, 2), match='Ca'>
None
None
None

In [ ]:
import re
pattern = r"[A|C][a-z]+"
test_string = [ "Apple", "Cat","hello", "Bat", "A" ]
for s in test_string:
    match = re.match( pattern, s )
    print(match)

<re.Match object; span=(0, 5), match='Apple'>
<re.Match object; span=(0, 3), match='Cat'>
None
None
None

In [ ]:
ser_str.str.fullmatch(r"[A|B][a-z]+") # 정확하게 똑같은 것 찾기

First     False
Second    False
Third     False
Fourth      NaN
dtype: object

In [ ]:
ser_str

First              Apple_사과  _500
Second       Banana_바나나      _300
Third           Cherry_체리   _1000
Fourth                           NaN
dtype: object

In [ ]:
ser_str.str.fullmatch("  Apple_사과  _500   ") # 정확하게 똑같은 것 찾기

First      True
Second    False
Third     False
Fourth      NaN
dtype: object

In [ ]:
ser_str.str[::-1] # 슬라이싱 (python의 슬라이싱과 같음)

First               005_  과사_elppA
Second       003_      나나바_ananaB
Third           0001_   리체_yrrehC
Fourth                           NaN
dtype: object

In [17]:
import pandas as pd

ser3 = pd.Series(['a1', 'b2', 'c3', 'd4e5f9', 'e6f7', 'f8'], dtype='string')
ser3.str.extractall(r"(\d)")

         0
  match
0 0      1
1 0      2
2 0      3
3 0      4
  1      5
  2      9
4 0      6
  1      7
5 0      8

In [18]:
ser3 = pd.Series(['a1', 'b2', 'c3', 'd4e5f9', 'e6f7', 'f8'], dtype='string')
ser3.str.extractall(r"([a-z])")

         0
  match
0 0      a
1 0      b
2 0      c
3 0      d
  1      e
  2      f
4 0      e
  1      f
5 0      f

In [19]:
ser3 = pd.Series(['a1', 'b2', 'c3', 'd4e5f9', 'e6f7', 'f8'], dtype='string')
ser3.str.extract(r"([a-z])") # 첫번째 오는 문자가 a-z 추출

   0
0  a
1  b
2  c
3  d
4  e
5  f

In [20]:
ser3 = pd.Series(['a1', 'b2', 'c3', 'd4e5f9', 'e6f7', 'f8'], dtype='string')
ser3.str.extractall(r"(\d)").groupby

<bound method DataFrame.groupby of          0
  match
0 0      1
1 0      2
2 0      3
3 0      4
  1      5
  2      9
4 0      6
  1      7
5 0      8>

In [21]:
ser3 = pd.Series(['a1', 'b2', 'c3', 'd4e5f9', 'e6f7', 'f8'], dtype='string')
digits = ser3.str.extractall(r"(\d)").groupby(level=0).agg(''.join)
digits

     0
0    1
1    2
2    3
3  459
4   67
5    8

In [22]:
ser3 = pd.Series(['a1', 'b2', 'c3', 'd4e5f9', 'e6f7', 'f8'], dtype='string')
digits = ser3.str.extractall(r"(\d)").groupby(level=0).agg(','.join)
digits

       0
0      1
1      2
2      3
3  4,5,9
4    6,7
5      8

In [23]:
ser3 = pd.Series(['A1', 'B2', 'C3', 'D4E5F9', 'E6F7', 'F8'], dtype='string')
대문자 = ser3.str.extractall(r"([A-Z])").groupby(level=0).agg(''.join)
대문자

     0
0    A
1    B
2    C
3  DEF
4   EF
5    F

In [24]:
ser3 = pd.Series(['가1', '나2', '다3', '라4마5바9', '사6아7', '자8'], dtype='string')
한글 = ser3.str.extractall(r"([가-힣])").groupby(level=0).agg(''.join)
한글

     0
0    가
1    나
2    다
3  라마바
4   사아
5    자

In [25]:
ser3 = pd.Series(['a1', 'b2', 'c3', 'd4e5f9', 'e6f7', 'f8'], dtype='string')
split_columns = ser3.str.extract(r"(?P<Letter>[a-z]+)(?P<Digit>\d+)")
split_columns

  Letter Digit
0      a     1
1      b     2
2      c     3
3      d     4
4      e     6
5      f     8

In [26]:
ser3 = pd.Series(['a1', 'b2', 'c3', 'd4e5f9', 'e6f7', 'f8'], dtype='string')
split_columns = ser3.str.extractall(r"(?P<Letter>[a-z]+)(?P<Digit>\d+)")
split_columns

        Letter Digit
  match
0 0          a     1
1 0          b     2
2 0          c     3
3 0          d     4
  1          e     5
  2          f     9
4 0          e     6
  1          f     7
5 0          f     8

In [27]:
ser3 = pd.Series(['a1', 'b2', 'c3', 'd4e5f9', 'e6f7', 'f8'], dtype='string')
split_columns = ser3.str.extractall(r"(?P<Letter>[a-z]+)(?P<Digit>\d+)").groupby(level=0).agg("".join)
split_columns

  Letter Digit
0      a     1
1      b     2
2      c     3
3    def   459
4     ef    67
5      f     8